Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/samd20/atdf/ATSAMD20E18.atdf
        <register offset="0x00000314" size="4" name="NVICIPR5" initval="0" caption="Interrupt Priority Register 5">
          <bitfield mask="0x000000ff" name="PRI20" caption="Priority of interrupt 20"/>
          <bitfield mask="0x0000ff00" name="PRI21" caption="Priority of interrupt 21"/>
          <bitfield mask="0x00ff0000" name="PRI22" caption="Priority of interrupt 22"/>
          <bitfield mask="0xff000000" name="PRI23" caption="Priority of interrupt 23"/>
        </register>
        <register offset="0x00000318" size="4" name="NVICIPR6" initval="0" caption="Interrupt Priority Register 6">
          <bitfield mask="0x000000ff" name="PRI24" caption="Priority of interrupt 24"/>
          <bitfield mask="0x0000ff00" name="PRI25" caption="Priority of interrupt 25"/>
          <bitfield mask="0x00ff0000" name="PRI26" caption="Priority of interrupt 26"/>
          <bitfield mask="0xff000000" name="PRI27" caption="Priority of interrupt 27"/>
        </register>
        <register offset="0x0000031C" size="4" name="NVICIPR7" initval="0" caption="Interrupt Priority Register 7">
          <bitfield mask="0x000000ff" name="PRI28" caption="Priority of interrupt 28"/>
          <bitfield mask="0x0000ff00" name="PRI29" caption="Priority of interrupt 29"/>
          <bitfield mask="0x00ff0000" name="PRI30" caption="Priority of interrupt 30"/>
          <bitfield mask="0xff000000" name="PRI31" caption="Priority of interrupt 31"/>
        </register>
      </register-group>
    </module></modules>
  <pinouts>
    <pinout name="SAMD20E" caption="SAMD20E">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PA02"/>
      <pin position="4" pad="PA03"/>
      <pin position="5" pad="PA04"/>
      <pin position="6" pad="PA05"/>
      <pin position="7" pad="PA06"/>
      <pin position="8" pad="PA07"/>
      <pin position="9" pad="VDDANA"/>
      <pin position="10" pad="GNDIO"/>
      <pin position="11" pad="PA08"/>
      <pin position="12" pad="PA09"/>
      <pin position="13" pad="PA10"/>
      <pin position="14" pad="PA11"/>
      <pin position="15" pad="PA14"/>
      <pin position="16" pad="PA15"/>
      <pin position="17" pad="PA16"/>
      <pin position="18" pad="PA17"/>
      <pin position="19" pad="PA18"/>
      <pin position="20" pad="PA19"/>
      <pin position="21" pad="PA22"/>
      <pin position="22" pad="PA23"/>
      <pin position="23" pad="PA24"/>
      <pin position="24" pad="PA25"/>
      <pin position="25" pad="PA27"/>
      <pin position="26" pad="RESET_N"/>
      <pin position="27" pad="PA28"/>
      <pin position="28" pad="GNDIO"/>
      <pin position="29" pad="VDDCORE"/>
      <pin position="30" pad="VDDIN"/>
      <pin position="31" pad="PA30"/>
      <pin position="32" pad="PA31"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>